Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་གང་ཡང་ཁྱོད་འདི་སྐད་དུ་བདག་གིས་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་ཆོས་དེ་ལྟ་བུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །ཞེས་ཟེར་བ་ནི།
en: Dt.115} “You said, Subhūti, ‘I do not observe any such thing as a “bodhisattva.”’

source: རབ་འབྱོར་ཆོས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: With regard to that statement of yours, Subhūti, mental phenomena do not observe the element of mental phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: The element of mental phenomena does not observe mental phenomena.

source: རབ་འབྱོར་གཟུགས་ཀྱི་དབྱིངས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Subhūti, the element of physical forms does not observe the element of mental phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་གཟུགས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of mental phenomena does not observe the element of physical forms.

source: །ཚོར་བའི་དབྱིངས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of feelings does not observe the element of mental phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཚོར་བའི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of mental phenomena does not observe the element of feelings.

source: །འདུ་ཤེས་ཀྱི་དབྱིངས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of perceptions does not observe the element of mental phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་འདུ་ཤེས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of mental phenomena does not observe the element of perceptions.

source: །འདུ་བྱེད་ཀྱི་དབྱིངས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of formative predispositions does not observe the element of mental phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་འདུ་བྱེད་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of mental phenomena does not observe the element of formative predispositions.

source: །རྣམ་པར་ཤེས་པའི་དབྱིངས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of consciousness does not observe the element of mental phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་རྣམ་པར་ཤེས་པའི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of mental phenomena does not observe the element of consciousness.

source: །མིག་གི་དབྱིངས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of the eyes does not observe the element of mental phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་མིག་གི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of mental phenomena does not observe the element of the eyes. The element of feelings does not observe the element of mental phenomena.

source: །རྣ་བའི་དབྱིངས་དང་། སྣའི་དབྱིངས་དང་། ལྕེའི་དབྱིངས་དང་། ལུས་ཀྱི་དབྱིངས་དང་། ཡིད་ཀྱི་དབྱིངས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of the ears, the element of the nose, the element of the tongue, the element of the body and the element of the mental faculty do not observe the element of mental phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཡིད་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The element of mental phenomena does not observe the element of the mental faculty [and so forth].

source: །རབ་འབྱོར་འདུས་བྱས་ཀྱི་དབྱིངས་ཀྱིས་འདུས་མ་བྱས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Subhūti, the conditioned elements do not observe unconditioned elements.

source: །འདུས་མ་བྱས་ཀྱི་དབྱིངས་ཀྱིས་འདུས་བྱས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Unconditioned elements do not observe conditioned elements.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདུས་བྱས་ཀྱི་དབྱིངས་མ་ཡིན་པར་ཡང་། འདུས་མ་བྱས་ཀྱི་དབྱིངས་གདགས་པར་མི་ནུས་སོ། །འདུས་མ་བྱས་ཀྱི་དབྱིངས་མ་ཡིན་པར་ཡང་འདུས་བྱས་ཀྱི་དབྱིངས་གདགས་པར་མི་ནུས་ཏེ།
en: If you ask why, unconditioned elements cannot be conceived apart from conditioned elements, nor can conditioned elements be conceived apart from unconditioned elements. “

source: རབ་འབྱོར་དེ་ལྟར་ན། ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Accordingly, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they do not observe any dharmas at all.

source: །ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་ཞིང་།
en: Since they do not observe anything, they do not fear, they do not tremble, and they will not be fearful.

source: དེའི་སེམས་ཆོས་གང་ལ་ཡང་ཞུམ་པར་མི་འགྱུར།
en: Their minds will not be discouraged in any respect whatsoever.

source: ཀུན་ཏུ་ཞུམ་པར་མི་འགྱུར།
en: They will not lose heart.

source: ཡིད་འགྱོད་པར་མི་འགྱུར་རོ།
en: They will not be regretful.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །མིག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །གཟུགས་ཡང་དག་པར་
en: If you ask why, Subhūti, it is because, when bodhisattva great beings practice the perfection of wisdom, they do not observe physical forms; they do not observe feelings, perceptions, formative predispositions, or consciousness; they do not observe the eyes; they do not observe the ears, the nose, the tongue, the body, or the mental faculty; they do not observe sights; and they do not observe sounds, odors, tastes, tangibles, or mental phenomena.

source: རྗེས་སུ་མི་མཐོང་ངོ་། །སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །སའི་ཁམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the earth element.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the water element, the fire element, the wind element, the space element, or the consciousness element.

source: །མ་རིག་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་།
en: They do not observe ignorance, and they do not observe formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, or aging and death.

source: སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །འདོད་ཆགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe attachment.

source: །ཞེ་སྡང་དང་། གཏི་མུག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe hatred or delusion.

source: །བདག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་།
en: They do not observe the self.

source: བྱེད་དུ་འཇུག་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཚོར་བར་བྱེད་པ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe sentient beings, life forms, life, living creatures, individuals, human beings, people, actors, agents, experiencers, instigators of experience, knowers, or viewers.

source: །འདོད་པའི་ཁམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the realm of desire.

source: །གཟུགས་ཀྱི་ཁམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the realm of form.

source: །གཟུགས་མེད་པའི་ཁམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the realm of formlessness. {

source: །ཉན་ཐོས་ཀྱི་སེམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Dt.116} They do not observe the mind of śrāvakas.

source: །རང་སངས་རྒྱས་ཀྱི་སེམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the mind of pratyekabuddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the mind of bodhisattvas.

source: །ཉན་ཐོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe śrāvakas.

source: །ཉན་ཐོས་ཀྱི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the attributes of śrāvakas.

source: །རང་སངས་རྒྱས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe pratyekabuddhas.

source: །རང་སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the attributes of pratyekabuddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the attributes of bodhisattvas.

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the attributes of buddhas.

source: །བྱང་ཆུབ་ཀྱི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe the attributes of enlightenment.

source: འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything, up to and including all mundane and supramundane phenomena.

source: །དེ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་རོ། །གསོལ་པ།
en: Since they do not observe any dharmas at all, they are not afraid, they do not tremble, and they will not be fearful.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་ལ་སེམས་ཞུམ་པར་མི་འགྱུར།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom in that manner, why do they not become discouraged with regard to all those dharmas?

source: ཡོངས་སུ་ཞུམ་པར་མི་འགྱུར་བ་ལགས།
en: Why will they not become utterly disheartened?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Subhūti,” replied the Blessed One, “it is because bodhisattva great beings do not observe such dharmas as the mind or mental states.

source: རབ་འབྱོར་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་ལ་སེམས་ཞུམ་པ་མེད་ཅིང་ཡོངས་སུ་ཞུམ་པ་མེད་དོ།
en: Subhūti, this is why when bodhisattva great beings practice the perfection of wisdom they do not become discouraged with regard to all those dharmas. They do not become utterly disheartened.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིད་ཡོངས་སུ་སྐྲག་པར་མི་འགྱུར་བ་ལགས།
en: Blessed Lord, how is it that bodhisattva great beings’ mental faculty experiences no fearfulness?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡིད་དང་། ཡིད་ཀྱི་ཁམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Subhūti,” replied the Blessed One, “it is because bodhisattva great beings do not observe a mental faculty or a sensory element of the mental faculty.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡིད་ཡོངས་སུ་སྐྲག་པར་མི་འགྱུར་རོ།
en: Subhūti, this is why bodhisattva great beings experience no fearfulness. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟར་ཆོས་ཐམས་ཅད་མི་དམིགས་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱ་སྟེ། རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: So it is, Subhūti, that bodhisattva great beings should train in the perfection of wisdom by not apprehending anything at all.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཡང་མི་དམིགས། བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡང་མི་དམིགས། བྱང་ཆུབ་སེམས་དཔའི་མིང་དེ་ཡང་མི་དམིགས། བྱང་ཆུབ་ཀྱི་སེམས་དེ་ཡང་མི་དམིགས་ན། དེ་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གདམས་ངག་ཡིན་ཏེ།
en: Subhūti, should it be the case that bodhisattva great beings practicing the perfection of wisdom apprehend no such perfection of wisdom, apprehend no such bodhisattva, apprehend no such term as bodhisattva, and apprehend no such mind of enlightenment, then that in itself is the essential advice for bodhisattva great beings!

source: དེ་ཉིད་རྗེས་སུ་བསྟན་པ་ཡིན་ནོ།
en: That is their very instruction.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་གསུམ་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: This completes the third chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གཟུགས་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Chapter 4 Then the venerable Subhūti said to the Blessed One, “Blessed Lord, bodhisattva great beings who wish to comprehend physical forms should train in the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Blessed Lord, bodhisattva great beings who wish to comprehend feelings, perceptions, formative predispositions, and consciousness should train in the perfection of wisdom. {

source: །བཅོམ་ལྡན་འདས་མིག་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Dt.117} Blessed Lord, bodhisattva great beings who wish to comprehend the eyes should train in the perfection of wisdom.

source: །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to comprehend the ears, the nose, the tongue, the body, and the mental faculty should train in the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་གཟུགས་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Blessed Lord, bodhisattva great beings who wish to comprehend sights should train in the perfection of wisdom.

source: །སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to comprehend sounds, odors, tastes, tangibles, and mental phenomena should train in the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་མིག་གི་རྣམ་བར་ཤེས་པ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Blessed Lord, bodhisattva great beings who wish to comprehend visual consciousness should train in the perfection of wisdom.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་བར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to comprehend auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness should train in the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་མིག་གི་འདུས་ཏེ་རེག་པ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Blessed Lord, bodhisattva great beings who wish to comprehend visually compounded sensory contact should train in the perfection of wisdom.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to comprehend aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact should train in the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Blessed Lord, bodhisattva great beings who wish to comprehend feelings conditioned by visually compounded sensory contact should train in the perfection of wisdom.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to comprehend feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact should train in the perfection of wisdom. “

source: །བཅོམ་ལྡན་འདས་མ་རིག་པ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ། །འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: Blessed Lord, bodhisattva great beings who wish to comprehend ignorance should train in the perfection of wisdom.

source: མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་།
en: Bodhisattva great beings who wish to comprehend formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, aging, ill health, death, sorrow, lamentation, suffering, discomfort, and agitation should train in the perfection of wisdom. “

source: སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ། །བཅོམ་ལྡན་འདས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་།
en: Blessed Lord, bodhisattva great beings who wish to abandon desire, hatred, and delusion should train in the perfection of wisdom.

source: གཏི་མུག་སྤང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ། །འཇིག་ཚོགས་སུ་ལྟ་བ་སྤང་བར་འཚལ་བ་དང་།
en: Bodhisattva great beings who wish to abandon false views about perishable composites should train in the perfection of wisdom.

source: ཐེ་ཚོམ་དང་། ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་སྙེམས་པ་སྤང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to abandon doubt and a sense of moral and ascetic supremacy should train in the perfection of wisdom.

source: །འདོད་པའི་འདོད་ཆགས་དང་། གནོད་སེམས་སྣང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to abandon attachment to [the realm of] desire and malice should train in the perfection of wisdom.

source: །གཟུགས་ཀྱི་འདོད་ཆགས་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་སྤང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to abandon attachment to [the realms of] form and formlessness should train in the perfection of wisdom.

source: །ཀུན་དུ་སྦྱོར་བ་དང་། བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་ལྡང་བ་སྤང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to abandon all fetters, latent impulses, and obsessions should train in the perfection of wisdom. “

source: །ཟས་བཞི་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to comprehend the four nourishments should train in the perfection of wisdom.

source: །སྦྱོར་བ་བཞི་དང་། ཆུ་བོ་བཞི་དང་། མདུད་པ་བཞི་དང་། ཉེ་བར་ལེན་པ་བཞི་དང་། ཕྱིན་ཅི་ལོག་བཞི་སྤང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to abandon the four bonds, the four torrents, the four knots, the four graspings, and the four misconceptions should train in the perfection of wisdom.

source: །མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་སྤང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to abandon the paths of the ten nonvirtuous actions should train in the perfection of wisdom.

source: །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the paths of the ten virtuous actions should train in the perfection of wisdom.

source: །བསམ་གཏན་བཞི་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the four meditative concentrations should train in the perfection of wisdom.

source: །ཚད་མེད་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the four immeasurable attitudes should train in the perfection of wisdom.

source: །གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the four formless absorptions should train in the perfection of wisdom.

source: །མངོན་པར་ཤེས་པ་ལྔ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the five extrasensory powers should train in the perfection of wisdom.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the perfection of generosity should train in the perfection of wisdom.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom should train in the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the emptiness of internal phenomena should train in the perfection of wisdom.

source: །ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the emptiness of external phenomena, the emptiness of external and internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, should train in the perfection of wisdom.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ། །ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: Bodhisattva great beings who wish to perfect the four applications of mindfulness should train in the perfection of wisdom.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path should train in the perfection of wisdom.

source: །སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect emptiness, signlessness, and wishlessness should train in the perfection of wisdom.
